LEXICON = {
    '/start': '<b>Привет, пользователь!</b>\n\nЭто бот, который поможет'
    ' тебе в построении своего тела!\n\nЧтобы завершить работу в режиме'
    ' POLLING наберите /die \n\nЧерез Ctrl-C в терминале вызывает фриз\n\n'
    'в режиме WEBHOOK фриза нет\n\n'
    'Чтобы узнать о возможностях бота - набери /help',
    '/die': 'Для остановки в режиме POLLING.\n\nЧерез Ctrl-C в терминале '
    'вызывает фриз\n\n режиме WEBHOOK фриза нет',
    '/help': 'Бот личностного роста.\n\nВыберите аспект вашей жизни который '
    'хотите прокачать.',
    'train': 'Выберите тренировку:',
    'mode': {'sleeping': 'Сон', 'diet': 'Питание', 'trainings': 'Тренировки'},
    'workout': {
        'pectoral': 'Грудь\\Бицепс',
        'back': 'Спина, плечи, трицепс',
        'legs': 'Ноги',
        'cardio': 'Кардио',
    },
    'backward': '<<',
    'forward': '>>',
}

LEXICON_COMMANDS = {
    '/start': 'Перезапуск бота',
    '/die': 'Стоп поллинг',
    '/help': 'Справка',
}
