SURVEY_QUESTIONS = (
    'Выберите пол',
    'Введите рост в см',
    'Введите вес в кг',
    'Введите возраст',
    'Выберите фразу, наиболее точно описывающую вашу физическую активность',
    'Выберите цель',
)
GENDER = (
    ('MALE', 'Мужчина'),
    ('FAMALE', 'Женщина'),
)
PHYSICAL_ACTIVITY = (
    'Отсутствует',
    'Редкие тренировки',
    'Умеренная активность',
    'Интенсивные тренировки',
    'Профессиональный спорт',
)

ACTIVITY_PURPOSE = (
    ('GO_SLIM', 'Сброс массы'),
    ('KEEP_LEVEL', 'Поддержание массы'),
    ('ADD_MASS', 'Набор массы'),
)

WORKOUT_TYPE = (
    ('Cardio', 'Кардио'),
    ('Legs', 'Ноги'),
    ('Back', 'Спина, плечи, трицепс'),
    ('Front', 'Грудь, бицепс'),
)
