SURVEY_QUESTIONS = (
    'Вы готовы ответить на несколько вопросов?',
    'Выберите пол',
    'Выберите фразу, наиболее точно описывающую вашу физическую активность',
    'Выберите цель',
    'Введите рост в см',
    'Введите вес в кг',
    'Введите возраст',
    'Введите электронную почту',
)
CONFIRM = (
    ('YES', 'Да'),
    ('NO', 'Нет'),
)
GENDER = (
    ('MALE', 'Мужчина'),
    ('FAMALE', 'Женщина'),
)
PHYSICAL_ACTIVITY = (
    ('ABSENT', 'Отсутствует'),
    ('INFREQUENT', 'Редкие тренировки'),
    ('MODERATE', 'Умеренная активность'),
    ('INTENSE', 'Интенсивные тренировки'),
    ('PROFESSIONAL', 'Профессиональный спорт'),
)

ACTIVITY_PURPOSE = (
    ('GO_SLIM', 'Сброс массы'),
    ('KEEP_LEVEL', 'Поддержание массы'),
    ('ADD_MASS', 'Набор массы'),
)

AM_NOON_PM = (
    ('AM', 'утро'),
    ('NOON', 'полдень'),
    ('PM', 'вечер'),
)

WORKOUT_TYPE = (
    ('Cardio', 'Кардио'),
    ('Legs', 'Ноги'),
    ('Back', 'Спина, плечи, трицепс'),
    ('Front', 'Грудь, бицепс'),
)

INTRO_SURVEY_TEXT = '<b>Здесь будет мотивирующие введение.</b>\n😜\n'

ALLOWED_AGE_RANGE = (14, 55)
ALLOWED_HEIGHT_RANGE = (100, 250)
ALLOWED_WEIGHT_RANGE = (20, 500)
